Repository: loginom/loginom-l10n-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: IP адрес или имя хоста (по умолчанию: %s)
en: IP address or hostname (default: %s)

source: Имя или GUID узла
en: Name or GUID of node

source: Путь и имя файла пакета (обязательный параметр)
en: Package path and file name (a required parameter)

source: Пароль
en: Password

source: Номер порта (по умолчанию: %s) или Unix domain socket (если не указан IP адрес)
en: Port number (by default, %s) or Unix domain socket (if the IP address is not specified)

source: Сохранять пакет после выполнения
en: Save package after execution

source: Режим переобучения
en: Retraining mode

source: Автоматическая деактивация групп узлов при их полном выполнении во время работы сценария
en: Automatic deactivation of node groups after their complete execution while running the workflow

source: Имя пользователя
en: Username

source: Использование: %s <ключи>
en: Usage: %s <keys>

source: <Ключи>
en: <Keys>

source: Любые другие ключи интерпретируются как имена переменных. Формат: <Имя_переменной>=<Значение_переменной>
en: Any other keys are interpreted as variable names. Format: <Variable_name>=<Variable_value>

source: Ошибка подключения к серверу
en: Server connection error

source: Ошибка пакетного выполнения
en: Batch processing error

source: Неверно указаны параметры командной строки
en: Invalid command line parameters

source: Неверное значение параметра %s ("%s"), он может принимать только значения %s или %s
en: Invalid value for the %s parameter ("%s"). The accepted values are %s or %s

source: Потеряно соединение с сервером
en: Server connection lost

source: Не указан обязательный параметр командной строки Package
en: Empty required Package command line parameter

source: Неизвестный параметр командной строки: %s
en: Unknown command line parameter: %s

source: Пример:
en: Example:

source: Строка - строковое выражение.
en: String - string expression.

source: Concat(Строка, Строка [, ... Строка])
en: Concat(String, String [, ... String])

source: Объединяет несколько строк в одну. Пропущенные значения интерпретируются как строки с нулевой длиной, т.е. как "".
en: Combines several strings into one. Null values are interpreted as the strings with zero length, namely, as "".

source: Угол - значение угла в радианах.
en: Angle - angle value in radians.

source: Cos(Угол)
en: Cos(Angle)

source: Возвращает косинус заданного угла.
en: Returns the cosine of the set angle.

source: Count(Строка)
en: Count(String)

source: Возвращает количество символов в строке.
en: Returns count of characters in the string.

source: Формат - способ строкового представления GUID ("N", "D", "B", "P"). ВерхнийРегистр - аргумент логического типа, определяющий регистр символов шестнадцатеричных цифр.
en: Format - method of GUID string representation ("N", "D", "B", "P"). UpperCase - argument of the logical type defining the character case of hexadecimal digits.

source: Строка - строка, для которой рассчитывается SHA1 значение.
en: String - a string for which the SHA1 value is calculated.

source: CreateGUID([Формат = "B", ВерхнийРегистр = True])
en: CreateGUID([Format = "B", UpperCase = True])

source: Функция возвращает строковое представление GUID в указанном формате: "N" - 32 цифры; "D" - 32 цифры, разделенные дефисами; "B" - 32 цифры, разделенные дефисами и заключенные в фигурные скобки; "P" - 32 цифры, разделенные дефисами и заключенные в круглые скобки. Если формат не указан, то используется формат "B". По умолчанию шестнадцатеричные цифры записываются в верхнем регистре. Так как GUID будет генерироваться каждый раз при получении значения выражения, например, при просмотре результата в виде таблицы или при выполнении экспорта данных, то в общем случае рекомендуется при наличии параметра выражения "Кэшировать" включить эту опцию.
en: Function returns GUID string representation in the specified format: "N" - 32 digits; "D" - 32 hyphenated digits; "B" - 32 hyphenated digits and digits in curved brackets; "P" - 32 hyphenated digits and digits in round brackets. If the format is not specified, use of "B" format is required. By default, hexadecimal digits are written in uppercase. As GUID will be generated each time when getting the expression value, for example, when viewing result in the tabular form or executing data export, it is generally recommended to activate this option if there is "Cache" expression parameter.

source: Строка1, Строка2 - выражения строкового типа.
en: String1, String2 - expressions of the string type.

source: DamLevDist(Строка1, Строка2)
en: DamLevDist(String1, String2)

source: Функция возвращает значение расстояния Дамерау-Левенштейна для строк Строка1, Строка2. Расстояние Дамерау-Левенштейна также называют расстоянием редактирования с учётом перестановок, которое является мерой похожести двух строк. Результат - это минимальное количество операций удалений, вставки, замены и перестановок символов, которое нужно произвести, чтобы преобразовать одну строку в другую.
en: The function returns the Damerau–Levenshtein distance for strings String1, String2. The Damerau–Levenshtein distance is a metric of similarity between two strings, an edit distance that allows transposition. The value returned is the minimum number of operations (consisting of insertions, deletions or substitutions of a single character, or transposition of two adjacent characters) required to change one string into the other.

source: Дата_время - выражение типа Дата/Время. Формат_даты - необязательный параметр формат даты в терминах D, M, Y. Формат_времени - необязательный параметр формат времени в терминах H, N, S, Z.
en: Date_time - expression of the Date/Time type. Date_format - optional parameter date format in terms of D, M, Y. Time_format - optional parameter time format in terms of H, N, S, Z.

source: DateTimeToStr(Дата_время [, Формат_даты [, Формат_времени]])
en: DateTimeToStr(Date_time [, Date_format [, Time_format]])

source: Возвращает строковое представление аргумента Дата_время. Примеры формата даты: "DD.MM.YY" - преобразует дату в формат "день.месяц.год" ("25.12.04") "MM/DD/YYYY" - преобразует дату в формат "месяц.день.год" ("12/25/2004") Примеры формата времени: "H:NN" - преобразует время в формат "часы:минуты" ("9:53") "HH:NN:SS" - преобразует время в формат "часы:минуты:секунды" ("09:05:53")
en: Returns the string representation of the Date_time argument. Examples of the date format: "DD.MM.YY" - converts the date into the "day.month.year" format ("25.12.04") "MM/DD/YYYY" - converts the date into the "month.day.year" format ("12/25/2004") Examples of the time format: "H:NN" - converts the time into the "hours:minutes" format ("9:53") "HH:NN:SS" - converts the time into the "hours:minutes:seconds" format ("09:05:53")

source: Дата - выражение типа Дата/Время. Формат - необязательный параметр формат даты в терминах D, M, Y.
en: Date - expression of the Date/Time type. Format - optional parameter date format in terms of D, M, Y.

source: DateToStr(Дата [, Формат])
en: DateToStr(Date [, Format])

source: SHA1(Строка)
en: SHA1(String)

source: Возвращает строковое представление аргумента Дата. Примеры формата даты: "DD.MM.YY" - преобразует дату в формат "день.месяц.год" ("25.12.04") "MM/DD/YYYY" - преобразует дату в формат "месяц.день.год" ("12/25/2004")
en: Returns the string representation of the Date argument. Examples of the date format: "DD.MM.YY" - converts the date into the "day.month.year" format ("25.12.04") "MM/DD/YYYY" - converts the date into the "month.day.year" format ("12/25/2004")

source: Дата - аргумент типа Дата/Время.
en: Date - a Date/Time type argument.

source: Day(Дата)
en: Day(Date)

source: Возвращает день по заданной дате.
en: Returns the day according to the specified date.

source: DayOfWeek(Дата)
en: DayOfWeek(Date)

source: Возвращает день недели заданной даты.
en: Returns the week day according to the specified date.

source: Дата1, Дата2 - аргументы типа Дата/Время. Абсолютное_Значение - необязательный параметр логического типа.
en: Date1, Date2 - Date/Time type arguments. Absolute_Value - an optional boolean parameter.

source: DaysBetween(Дата1, Дата2[, Абсолютное_Значение = True])
en: DaysBetween(Date1, Date2[, Absolute_Value = True])

source: Возвращает количество полных дней между двумя датами. Если Дата2 раньше Дата1 и Абсолютное_Значение = False, то будет возвращено отрицательное число полных временных промежутков между датами; если Абсолютное_значение = True, то функция вернёт модуль значения
en: Returns the number of complete days between two dates. If Date2 is earlier than Date1 and Absolute_Value = False, the function will return the negative number of complete time spans between the dates; if Absolute_Value = True, the function will return the absolute value

source: Функция возвращает HEX значение SHA1, рассчитанное от заданной строки. Расчеты производятся над последовательностью символов Строки в кодировке UTF-8.
en: The function returns the HEX value of the SHA1 calculated from the given string. The String's character sequence is processed using UTF-8 encoding.

source: Выражение - выражение, значение которого поочередно сравнивается со значениями аргументов ЗначениеN. ЗначениеN - выражение, величина которого сравнивается с аргументом Выражение. РезультатN - выражение строкового типа, которое возвращается, если Выражение = ЗначениеN. Значение_по_умолчанию - выражение строкового типа, результат которого возвращается, если Выражение не равно ни одному из ЗначениеN (если не указано, то равно "").
en: Expression - the expression value of which is alternately compared with the values of the ValueN arguments. ValueN - the expression value of which is compared with the Expression argument. ResultN - the expression of the string type that is returned if the Expression = ValueN. Default_value - the expression of the string type the result of which is returned if the Expression is equal to none of the ValuesN (if it is not stated then it is equal to "").

source: Decode(Выражение, Значение1, Результат1 [, Значение2, Результат2]... [, Значение_по_умолчанию = ""])
en: Decode(Expression, Value1, Result1 [, Value2, Result2]... [, Default_value = ""])

source: Реализует функциональность IF - THEN - ELSE, при этом результат функции имеет строковый тип. Все выражения РезультатN вычисляются до сравнения Выражения с ЗначениеN.
en: Implements IF - THEN - ELSE feature and the function result is related to the string type. All ResultN expressions are calculated before the Expression and ValueN comparison.

source: Выражение - любое числовое выражение, величина которого используется для сравнения. Погрешность - числовое выражение, погрешность сравнения. ЗначениеN - числовое выражение, величина которого сравнивается с аргументом Выражение. РезультатN - значение, которое возвращается, если |ЗначениеN - ВыражениеN| <= Погрешность. Значение_по_умолчанию - числовое выражение, результат которого возвращается, если ни одно ЗначениеN не равно Выражению (по умолчанию 0).
en: Expression - any numeric expression value of which is used for comparison. Error - the numeric expression, comparison error. ValueN - the numeric expression value of which is compared with the Expression argument. ResultN - the value that is returned if |ValueN - ExpressionN| <= Error. Default_value - the numeric expression the result of which is returned if none of the ValuesN is equal to the Expression (by default 0).

source: DecodeF(Выражение, Погрешность, Значение1, Результат1 [, Значение2, Результат2]... [, Значение_по_умолчанию = 0])
en: DecodeF(Expression, Error, Value1, Result1 [, Value2, Result2]... [, Default_value = 0])

source: Реализует функциональность IF - THEN - ELSE, при этом результат функции, также как и все ее аргументы, имеют числовой тип или тип Дата/Время. Все выражения РезультатN вычисляются до сравнения Выражения с ЗначениеN.
en: Implements IF - THEN - ELSE feature and the function result as all its arguments are related to the numeric or Date/Time type. All ResultN expressions are calculated before the Expression and ValueN comparison.

source: Выражение - выражение, значение которого поочередно сравнивается со значениями аргументов ЗначениеN. ЗначениеN - выражение, величина которого сравнивается с аргументом Выражение. РезультатN - выражение числового типа или типа Дата/Время, которое возвращается, если Выражение = ЗначениеN. Значение_по_умолчанию - выражение числового типа или типа Дата/Время, результат которого возвращается, если Выражение не равно ни одному из ЗначениеN (если не указано, то равно 0).
en: Expression - the expression value of which is alternately compared with the values of the ValueN arguments. ValueN - the expression value of which is compared with the Expression argument. ResultN - the expression of the numeric or Date/Time type that is returned if the Expression = ValueN. Default_value - the expression of the numeric or Date/Time type the result of which is returned, if the Expression is equal to none of the ValuesN (if it is not stated then it is equal to 0).

source: DecodeN(Выражение, Значение1, Результат1 [, Значение2, Результат2]... [, Значение_по_умолчанию = 0])
en: DecodeN(Expression, Value1, Result1 [, Value2, Result2]... [, Default_value = 0])

source: Реализует функциональность IF - THEN - ELSE, при этом результат функции имеет числовой тип или тип Дата/Время. Все выражения РезультатN вычисляются до сравнения Выражения с ЗначениеN.
en: Implements IF - THEN - ELSE feature and the function result is related to the numeric or Date/Time type. All ResultN expressions are calculated before the Expression and ValueN comparison.

source: Строка - строка, для которой рассчитывается SHA256 значение.
en: String - a string for which the SHA256 value is calculated.

source: DecodeS(Выражение, Значение1, Результат1 [, Значение2, Результат2]... [, Значение_по_умолчанию = ""])
en: DecodeS(Expression, Value1, Result1 [, Value2, Result2]... [, Default_value = ""])

source: Выражение - выражение, значение которого поочередно сравнивается со значениями аргументов Значение. Значение - выражение, величина которого сравнивается с аргументом Выражение. Результат - выражение, которое возвращается, если Выражение = Значение. Значение_по_умолчанию - выражение, результат которого возвращается, если Выражение не равно ни одному из Значений (если не указано, то равно Null).
en: Expression - the expression value of which is alternately compared with the values of the Value arguments. Value - the expression value of which is compared with the Expression argument. Result - the expression that is returned if the Expression = Value. Default_value - the expression, the result of which is returned if the Expression is equal to none of the Values (if it is not stated then it is equal to Null).

source: DecodeV(Выражение, Значение, Результат [, Значение, Результат]... [, Значение_по_умолчанию = Null])
en: DecodeV(Expression, Value, Result [, Value, Result]... [, Default_value = Null])

source: Реализует функциональность IF - THEN - ELSE. Все выражения Результат вычисляются до сравнения Выражения со Значениями
en: Implements IF - THEN - ELSE feature. All Result expressions are calculated before the Expression and Values comparison

source: Делимое - целое числовое выражение, Делитель - целое числовое выражение.
en: Dividend - integer numeric expression, Divisor - integer numeric expression.

source: Div(Делимое, Делитель)
en: Div(Dividend, Divisor)

source: Возвращает частное целочисленного деления Делимого на Делитель.
en: Returns the integer division quotient of the Dividend by the Divisor.

source: Год - год в виде числа, Месяц - месяц в виде числа, День - день в виде числа.
en: Year - year in the form of a number, Month - month in the form of a number, Day - day in the form of a number.

source: EncodeDate(Год, Месяц, День)
en: EncodeDate(Year, Month, Day)

source: SHA256(Строка)
en: SHA256(String)

source: Функция возвращает дату, сформированную из указанных аргументов.
en: Function returns the date formed from the specified arguments.

source: Год - год в виде числа, Месяц - месяц в виде числа, День - день в виде числа, Часы - часы в виде числа, Минуты - минуты в виде числа, Секунды - секунды в виде числа, Миллисекунды - миллисекунды от 0 до 999.
en: Year - the number of the year, Month - the number of the month, Day - the number of the day, Hours - the number of hours, Minutes - the number of minutes, Seconds - the number of seconds, Milliseconds - the number of milliseconds (0–999).

source: EncodeDateTime(Год, Месяц, День, Часы, Минуты [, Секунды [, Миллисекунды]])
en: EncodeDateTime(Year, Month, Day, Hours, Minutes [, Seconds [, Milliseconds]])

source: Функция возвращает дату и время, сформированные из указанных аргументов.
en: Function returns the date and time formed from the specified arguments.

source: Часы - часы в виде числа, Минуты - минуты в виде числа, Секунды - секунды в виде числа, Миллисекунды - миллисекунды от 0 до 999.
en: Hours - the number of hours, Minutes - the number of minutes, Seconds - the number of seconds, Milliseconds - the number of milliseconds (0–999).

source: EncodeTime(Часы, Минуты [, Секунды [, Миллисекунды]])
en: EncodeTime(Hours, Minutes [, Seconds [, Milliseconds]])

source: Функция возвращает время, сформированное из указанных аргументов.
en: Function returns the time formed from the specified arguments.

source: EndOfTheMonth(Дата)
en: EndOfTheMonth(Date)

source: Функция возвращает дату и время окончания месяца, указанного в Дата
en: The function returns the ending date and time of the month specified in Date

source: Функция возвращает HEX значение SHA256, рассчитанное от заданной строки. Расчеты производятся над последовательностью символов Строки в кодировке UTF-8.
en: The function returns the HEX value of the SHA256 calculated from the given string. The String's character sequence is processed using UTF-8 encoding.

source: EndOfTheQuarter(Дата)
en: EndOfTheQuarter(Date)

source: Функция возвращает дату и время окончания квартала, к которому относится указанная Дата
en: The function returns the ending date and time of the quarter to which the specified Date belongs

source: EndOfTheWeek(Дата)
en: EndOfTheWeek(Date)

source: Функция возвращает дату и время окончания указанной недели в соответствии со стандартом ISO 8601, по которому неделя начинается с понедельника и заканчивается воскресеньем.
en: The function returns the ending date and time of the specified week following the ISO 8601 standard, under which weeks start on Monday and end on Sunday.

source: EndOfTheYear(Дата)
en: EndOfTheYear(Date)

source: Функция возвращает дату и время окончания года, указанного в Дата
en: The function returns the ending date and time of the year specified in Date

source: Степень - числовое выражение.
en: Degree - numeric expression.

source: Строка - строка, для которой рассчитывается SHA384 значение.
en: String - a string for which the SHA384 value is calculated.

source: Exp(Степень)
en: Exp(Degree)

source: Возвращает число e в заданной степени.
en: Returns the constant e raised to the specified power.

source: Аргументы - значения числового ряда
en: Arguments - values of the numeric series

source: Применяется для построения пользовательской модели экспоненциально сглаженного скользящего среднего. Экспоненциально сглаженное скользящее среднее, в отличие от простого скользящего среднего придает последним наблюдениям более значимый вес, чем предпоследним, и т.д. Формула вычисления задается рекуррентным соотношением: EMA(t) = a * X(t) + (1 - a) * EMA(t-1), где EMA(k) - значение экспоненциально сглаженного скользящего среднего в точке k, a - параметр сглаживания, a = 2 / (n + 1), где n - ширина окна.
en: Used for the construction of the user model of the exponentially weighted moving average. Unlike the simple moving average, with the exponential moving average the weighting for each older datum decreases exponentially. EMA is calculated using the following recursive formula: EMA(t) = a * X(t) + (1 - a) * EMA(t-1), where EMA(k) is the value of the exponential moving average in point k and a is the smoothing factor, a = 2 / (n + 1), with n being the window length.

source: Аргумент - целое положительное числовое выражение.
en: Argument - integer positive numeric expression.

source: Factorial(Аргумент)
en: Factorial(Argument)

source: Возвращает факториал аргумента.
en: Returns the argument factorial.

source: Подстрока - искомая подстрока, Строка - строка, в которой ищется подстрока, Порядок - необязательный параметр, позицию какого по счету вхождения Подстроки в Строку возвращать. Аргумент числового типа.
en: Substring - searched substring, String - the string in which substring is searched, MatchIndex - optional occurrence index of the Substring in the String to be returned. Argument of the numeric type.

source: Find(Подстрока, Строка[, Порядок = 1])
en: Find(Substring, String[, MatchIndex = 1])

source: SHA384(Строка)
en: SHA384(String)

source: Функция возвращает позицию первого символа Подстроки заданного Порядка в Строке. Порядок может быть как положительным, так и отрицательным. Если Порядок положительный, то поиск происходит слева направо, если отрицательный, то справа налево. Если вхождения заданного порядка нет, то функция возвращает 0. Например, Find("A", "A000A00A", 2) вернет позицию второго слева вхождения подстроки "A" в строку "A000A00A", т.е. 5; Find("A", "A000A00A", -1) вернет позицию первого справа вхождения подстроки "A" в строку "A000A00A", т.е. 8. Если Порядок равен нулю, то функция возвращает Неопределенное значение (Null).
en: Function returns position of the first character of the Substring of the set MatchIndex in the String. The MatchIndex can be both positive and negative. If the MatchIndex is positive, the search is performed from left to right, if it is negative, the search is performed from right to left. If there is no occurrence of the set order, the function returns 0. For example, Find("A", "A000A00A", 2) will return position of the second left occurrence of substring "A" to string "A000A00A", namely, 5; Find("A", "A000A00A", -1) will return position of the first right occurrence of substring "A" to string "A000A00A", namely, 8. If the MatchIndex is equal to zero, the function will return the null value (Null).

source: Строка_формата - строковое выражение специального вида Выражение - произвольное строковое выражение.
en: Format_string - string expression of the special type Expression - arbitrary string expression.

source: Format(Строка_формата, Выражение [, ... Выражение])
en: Format(Format_string, Expression [, ... Expression])

source: Возвращает список выражений в заданном формате. Строка_формата имеет следующий вид: [Строка] %s [Строка] [... [[Строка]%s[Строка]]] Строка - строковое выражение %s - символ, на место которого ставится очередное Выражение из списка.
en: Returns the list of expressions in the given format. Format_string is represented below: [String] %s [String] [... [[String]%s[String]]] String - string expression %s - character that is replaced by another Expression from the list.

source: Аргумент - числовое выражение.
en: Argument - numeric expression.

source: Frac(Аргумент)
en: Frac(Argument)

source: Возвращает дробную часть Аргумента.
en: Returns the fractional part of the Argument.

source: ДатаВремя - аргумент типа Дата/Время.
en: DateTime - a Date/Time type argument.

source: Hour(ДатаВремя)
en: Hour(DateTime)

source: Возвращает час по заданной дате/времени.
en: Returns the hour according to the specified date/time.

source: Функция возвращает HEX значение SHA384, рассчитанное от заданной строки. Расчеты производятся над последовательностью символов Строки в кодировке UTF-8.
en: The function returns the HEX value of the SHA384 calculated from the given string. The String's character sequence is processed using UTF-8 encoding.
